{
    "data" : [
        {
            "title": "Professional Experience",
            "time": "Jul 2023 – Jun 2025",
            "header": "Cognizant | Full Stack Developer",
            "content_list": ["Proposed, developed and launched new features aimed at increasing user retention and enhancing interaction speed.", 
                            "Collaborated with cross-functional teams to deliver full-stack software deployments using Angular and Node.js in a live production environment under tight deadlines.",
                            "Led the architecture and development of synchronous microservices, resulting in a 15% boost in application speed and a 20% decrease in system errors.",
                            "Spearheaded the decommissioning of the legacy WMIS API and played a key role in the successful rollout of the modern SIPD API, resulting in a more scalable and secure backend system.",
                            "Provided technical leadership by supporting a junior developer’s growth, enabling them to contribute independently to production-level features.",
                            "Identified and removed over 2,000 lines of redundant code, improving codebase maintainability and performance."],
            "technical": ["AWS", "JavaScript", "Angular", "SAP", "TypeScript"]
        },
        {
            "title": "",
            "time": "Nov 2020 – Apr 2021",
            "header": "More Life Home | Front End Developer",
            "content_list": ["Developed, designed and deployed a responsive, high-performance website using React, TypeScript and Tailwind CSS",
                            "Optimized website UX and functionality, collaborating on technical priorities and implementing SEO to boost site engagement and visibility.",
                            "Contributed to blog content creation to support outreach and awareness initiatives."],
            "technical": ["React JS", "SCSS", "JavaScript"]
        },
        {
            "title": "",
            "time": "Oct 2020",
            "header": "GE Explorer | Data Engineering Intern",
            "content": "Developed data visualisation skills on the programme using data to create a run chart and KPI (key performance indicators) tables based off simulated aviation data.",
            "technical": ""
        },
        {
            "title": "Education",
            "time": "2019 – 2022",
            "header": "Queen Mary University of London",
            "content": "BSc Computer Science, 1st Class Honours",
            "content_list": ["Modules: Neural Networks & Deep Learning, Algorithms & Data Structures, Object-Oriented Programming, Database Systems, Logic and Discrete Structures, Web Development, Computer Systems and Networks"],
            "technical": ""
        },
        {
            "title": "Personal Projects",
            "time": "",
            "header": "WorkSpace | Productivity Application",
            "content_list": ["Developed a cross-platform productivity application, comprising an Android app and a responsive website using React for the frontend and cloud-based services for the backend.",
                        "Implemented features involving user authentication, data persistence, and real-time updates while ensuring compliance with privacy standards and platform permissions.",
                        "Focused on scalable architecture, UI/UX design, and performance optimization to ensure a seamless and secure user experience."
            ],
            "technical": ["ReactNative", "JavaScript", "Expo", "Django", "OpenShift", "Firebase"]
        },
        {
            "title": "Qualifications",
            "time": "",
            "header": "Courses",
            "content": "React JS, AWS, Angular JS, Java SE 8, GitHub Co-Pilot, Node JS, Dataiku",
            "technical": ""
        }
    ]
}