{
    "data" : [
        {
            "title": "Professional Experience",
            "time": "2023 – 2025",
            "header": "Cognizant | Software Engineer",
            "content": "Gained experience as part of an agile development team, to create an agent-facing chatbot to improvecustomer experience and assure interactions meet client guidelines. Partook in planning and researchmeetings, contributing to discussions on feasibility, duration and codebase quality. Also, took theinitiative to research and propose new features, that greatly enhanced functionality and improved theoverall user experience.",
            "technical": ["AWS", "JavaScript", "Angular", "SAP", "TypeScript"]
        },
        {
            "title": "",
            "time": "2020 – 2021",
            "header": "More Life Home | Internship",
            "content": "More life home is an environmentally friendly focused non-profit organisation. I was responsible forthe development and design of the company website, working to optimise user experience and maximise engagement. I steered decisions around the development of priorities and campaigns, as well as contributing to the websites blog posts.",
            "technical": ["React JS", "SCSS", "JavaScript"]
        },
        {
            "title": "",
            "time": "",
            "header": "GE Explorer | Virtual Internship",
            "content": "I participated in a digital technology analytics program to give me an insight into careers in data engineering and data visualisation. I developed my data visualisation skills on the programme; we used data to create a run chart and KPI (key performance indicators) tables based off simulated aviation data.",
            "technical": ""
        },
        {
            "title": "Education",
            "time": "2019 – 2022",
            "header": "Queen Mary University of London",
            "content": "BSc Computer Science, 1st Class Honours {'\n'} Modules: Neural Networks & Deep Learning, Algorithms & Data Structures, Object-Oriented Programming, Database Systems, Logic and Discrete Structures, Web Development, Computer Systems and Networks",
            "technical": ""
        },
        {
            "title": "Personal Projects",
            "time": "",
            "header": "Productivity App",
            "content": "Created an Android app and Website as part of a productivity application, while working I gained a plethora of skills and experiences. I dealt with ethical and legal issues like user location, asynchronous storage and permissions. I also gained valuable insights into aspects of software development like Cloud Computing, UI/UX, and app optimisations.",
            "technical": ["ReactNative", "JavaScript", "Expo", "Django", "OpenShift", "Firebase"]
        },
        {
            "title": "Qualifications",
            "time": "",
            "header": "Certificates",
            "content": "React JS, AWS, Angular JS, Java SE 8, GitHub Co-Pilot, Node JS, Dataiku",
            "technical": ""
        }
    ]
}